{
  "architectures": [
    "Qwen3_5ForConditionalGeneration"
  ],
  "max_position_embeddings": 16,
  "model_type": "qwen3_5",
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "text_config": {
    "head_dim": 2,
    "hidden_size": 2,
    "intermediate_size": 2,
    "layer_types": [
      "linear_attention",
      "full_attention"
    ],
    "linear_conv_kernel_dim": 1,
    "linear_key_head_dim": 1,
    "linear_num_key_heads": 1,
    "linear_num_value_heads": 1,
    "linear_value_head_dim": 1,
    "model_type": "qwen3_5_text",
    "num_attention_heads": 1,
    "num_hidden_layers": 2,
    "num_key_value_heads": 1,
    "tie_word_embeddings": false
  },
  "tie_word_embeddings": false,
  "vocab_size": 3
}
